---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewTransparentMode
source: html/c7fd03ba-aa73-be65-6860-ae341a1a0c85.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewTransparentMode Property

"Show Surfaces Transparent"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewTransparentMode { get; }
```